In [6]:
import pandas as pd
import numpy as np

# To get the Current Diretory Path

In [7]:
pwd()

'C:\\Users\\gokulnathan.mani'

# To read the CSV file from specific directory

In [12]:
Cust_data = pd.read_csv(r"C:\Learning\Training Documents\Mall_Customers.csv")
Cust_data

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

    # No. of Rows in the CSV

In [14]:
len(Cust_data.index)

200

In [15]:
len(Cust_data.columns)

5

In [16]:
Cust_data.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [17]:
list(Cust_data.columns)

['CustomerID', 'Genre', 'Age', 'Annual Income (k$)', 'Spending Score (1-100)']

In [19]:
Cust_data.sort_values('Age')

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
114         115  Female   18                  65                      48
91           92    Male   18                  59                      41
65           66    Male   18                  48                      59
33           34    Male   18                  33                      92
0             1    Male   19                  15                      39
..          ...     ...  ...                 ...                     ...
90           91  Female   68                  59                      55
108         109    Male   68                  63                      43
57           58    Male   69                  44                      46
70           71    Male   70                  49                      55
60           61    Male   70                  46                      56

[200 rows x 5 columns]

In [24]:
Cust_data.sort_values(by='Annual Income (k$)', ascending=False).head()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
199         200    Male   30                 137                      83
198         199    Male   32                 137                      18
197         198    Male   32                 126                      74
196         197  Female   45                 126                      28
195         196  Female   35                 120                      79

In [26]:
Cust_data.sort_values(by=['Annual Income (k$)','Spending Score (1-100)'], ascending=[False,True]).head()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
194         195  Female   47                 120                      16